OpenFOAM-6-cantera/tutorials/lagrangian/reactingParcelFoam/filter/0.orig/G
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1;
        value           uniform 0;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 0;
    }
    inlet
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1;
        value           uniform 0;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    cycLeft_half0
    {
        type            cyclic;
    }
    cycRight_half0
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
    cycLeft_half1
    {
        type            cyclic;
    }
    cycRight_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
